org/In_what_sense_can_gene-regulatory_networks_be_thought_of_as_performing_inference_upon_the_dynamics_of_the_environments_within_which_they_are_embedded.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: In_what_sense_can_gene-regulatory_networks_be_thought_of_as_performing_inference_upon_the_dynamics_of_the_environments_within_which_they_are_embedded
#+TITLE: In what sense can gene-regulatory networks be thought of as performing inference upon the dynamics of the environments within which they are embedded?
* [[file:systems_biology.org][systems biology]], [[file:questions.org][questions]]
* Gene-regulatory networks can be thought of as components within the process by which organisms compute and execute particular actions on the basis of marginal observations of their biochemical environments. In order for this principle to take on significant meaning, there needs to be a demonstration of more than one example of dynamic signal integration, processing, and subsequent state change that is involved in essential functioning and cannot be understood without accounting for the fundamentally dynamic nature of such processes.
