content/posts/In_what_sense_can_gene-regulatory_networks_be_thought_of_as_performing_inference_upon_the_dynamics_of_the_environments_within_which_they_are_embedded.md
+++
title = "In what sense can gene-regulatory networks be thought of as performing inference upon the dynamics of the environments within which they are embedded?"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:44-04:00
slug = "In_what_sense_can_gene-regulatory_networks_be_thought_of_as_performing_inference_upon_the_dynamics_of_the_environments_within_which_they_are_embedded"
draft = false
+++

## [systems biology]({{< relref "systems_biology" >}}), [questions]({{< relref "questions" >}}) {#systems-biology--systems-biology-dot-md--questions--questions-dot-md}


## Gene-regulatory networks can be thought of as components within the process by which organisms compute and execute particular actions on the basis of marginal observations of their biochemical environments. In order for this principle to take on significant meaning, there needs to be a demonstration of more than one example of dynamic signal integration, processing, and subsequent state change that is involved in essential functioning and cannot be understood without accounting for the fundamentally dynamic nature of such processes. {#gene-regulatory-networks-can-be-thought-of-as-components-within-the-process-by-which-organisms-compute-and-execute-particular-actions-on-the-basis-of-marginal-observations-of-their-biochemical-environments-dot-in-order-for-this-principle-to-take-on-significant-meaning-there-needs-to-be-a-demonstration-of-more-than-one-example-of-dynamic-signal-integration-processing-and-subsequent-state-change-that-is-involved-in-essential-functioning-and-cannot-be-understood-without-accounting-for-the-fundamentally-dynamic-nature-of-such-processes-dot}
